{
  "basics": {
    "name": "Allen Gooch",
    "label": "Senior Software Systems Developer and Technical Manager",
    "email": "allen.gooch@gmail.com",
    "phone": "512.496.3401",
    "website": "http://allengooch.me",
    "summary": "Senior software systems developer with systems programming, applications development, and technology leadership experience over full lifecycle of large-scale distributed systems, massively-multiplayer client-server and peer-to-peer online games.",
    "location": {
      "address": "2408 Drifting Leaf Drive",
      "postalCode": "TX 78613",
      "city": "Cedar Park",
      "countryCode": "US",
      "region": "Texas"
    }
  },
  "work": [
    {
      "company": "BioWare / Electronic Arts",
      "position": "Senior Software Engineer",
      "startDate": "2007-11-26",
      "endDate": "2015-03-31",
      "summary": "Senior server software engineer responsible for server infrastructure for 'Star Wars: The Old Republic', a massively-multiplayer online role-playing game, and other titles.",
      "highlights": [
        "Led design and implementation of system for collection and real-time querying of metrics exported by game services for debugging and analytics use.",
        "Led design and implementation of system for configuration, provisioning, and control of game services and hosts.",
        "Ported MMO engine and supporting technologies used by MMO game services from 32-bit Windows platform to 64-bit Linux platform resulting in decreased operations cost.",
	"Managed team responsible for tooling, configuration and control of MMO game services."
      ]
    },
    {
      "company": "Midway Studios",
      "position": "Senior Software Engineer",
      "startDate": "2006-06-05",
      "endDate": "2007-11-08",
      "summary": "Lead multiplayer engineer responsible for multiplayer technology for unreleased title on Xbox 360 and PS3 consoles.",
      "highlights": [
        "Worked with design and art in creating a fun and rewarding console multiplayer experience.",
        "Created schedules, tasking for multiplayer engineering team.",
	    "Assisted Blacksite: Area 51 team with user interface, matchmaking, TCR/TRC, and Xbox Live programming tasks."
      ]
    },
    {
      "company": "Sony Computer Entertainment America",
      "position": "Senior Software Engineer",
      "startDate": "2005-06-29",
      "endDate": "2006-04-07",
      "summary": "Primary engineer responsible for multiplayer aspects of PSP product under development.  Multiplayer feature set included game share, downloadable content from Internet site or Adhoc peer, and Adhoc multiplayer game play.",
      "highlights": [
        "Evolved a legacy C code base to a more flexible C++ one capable of supporting maintenance and enhancement of primary product line at a much greater rate of delivery.",
        "Performed migration from Visual Source Safe to Perforce and provided Perforce support to product development team.",
	    "Integrated JIRA with Perforce solution for full traceability of repository changes to issues necessitating the change."
      ]
    },
    {
      "company": "Video Gaming Technologies",
      "position": "Senior Software Engineer",
      "startDate": "2004",
      "endDate": "2005",
      "summary": "Lead engineer responsible for development of proprietary networking services and infrastructure, and integration with external casino network service infrastructure.",
      "highlights": [
        "Defined and installed networking infrastructure/services to support development efforts in new engineering division.  This included installation and administration of firewalls, hardware and software VPNs, intranets, defect tracking solution, and configuration management solution in heterogeneous multi-site Linux/Windows Server 2003 environment.",
        "Developed lightweight, portable C++ COM framework capable of providing dynamically loadable components on DOS, Windows, and Linux platforms.",
    	"Extended a proprietary networking middleware system to provide dynamic service discovery and provisioning enabling all single points of failure to be removed from primary casino services product, and enabling highly-availability and self-healing casino gaming service networks.",
	    "Evolved a legacy C++ client code base to a more flexible system capable of supporting maintenance and enhancement of primary product line at a much greater rate of delivery.",
	    "Developed patent-pending casino cashless gaming system providing capabilities to customers at a lower price point enabling greater customer retention and customer acquisition.",
	    "Integrated casino cashless gaming system with multiple third-party cashless gaming web services.",
	    "Defined, documented, and instituted software processes, coding standards, roles, activities, and methodologies.",
	    "Developed continuous integration tools in Python to enable automatic builds, deployment and test plan execution of primary casino gaming clients and services product."
      ]
    },
    {
      "company": "Darden Solutions",
      "position": "Contract J2EE Developer",
      "startDate": "2003",
      "endDate": "2004",
      "summary": "Contract programmer for a three-tier Java J2EE commercial product suite of applications used by many top graduate business schools for all aspects of participation from admissions to alumni.",
      "highlights": [
	    "Developed graduate business school career development system with JBoss, Spring, Hibernate and Microsoft SQL Server.",
	    "Developed reusable Java web components for web presentation layer in graduate business school product suite."
      ]
    },
    {
      "company": "Ubisoft",
      "position": "Consultant",
      "startDate": "2003",
      "endDate": "2003",
      "summary": "Consultant for an online engineering organization, conducting analysis and making recommendations for future development of online team and multiplayer game technologies.",
      "highlights": [
	    "Analyzed existing proprietary and third-party networking tools and technologies for utility and fitness in peer-to-peer matchmaking and leader board systems.",
	    "Analyzed resources and processes in game networking group for fitness in meeting business goals as related to corporate-wide multiplayer initiatives."
      ]
    },
    {
      "company": "Maxis / Electronic Arts",
      "position": "Senior Software Engineer",
      "startDate": "2002",
      "endDate": "2003",
      "summary": "Lead engineer responsible for various pieces of server software infrastructure for The Sims Online (TSO), a massively-multiplayer online game (MMOG).",
      "highlights": [
	    "Successfully led development team on high-risk, high-return project to add user stream encryption capabilities to the middleware platform (ARIES) providing significant risk-reduction of network attacks.",
	    "Successfully led development team on project to add enhanced user authorization capabilities to the ARIES platform.  This project provided significant performance gains, lower complexity and greater functionality than the previously existing solution.",
	    "Successfully led project to integrate TSO server systems with Electronic Arts (EA) online authentication/authorization systems.",
	    "Developed continuous integration tools in Python to enable automatic builds, deployment and test plan execution of all ARIES platform code and the C++ and Java SDKs."
      ]
    },
    {
      "company": "Electronic Arts",
      "position": "Senior Software Engineer",
      "startDate": "2001",
      "endDate": "2002",
      "summary": "Producer and technical lead responsible for tools and technologies supporting online game development customers within Electronic Arts.",
      "highlights": [
	    "Led development of tools and technologies supporting online game development customers within Electronic Arts including C++ and Java service runtimes for MMOG applications, component-based development SDKs of plug-and-play C++ and Java binary components, and a white-box source framework for MMOG development.",
	    "Successfully led development team on project providing reusable C++ and Java binary components for instrumentation and remote monitoring/management of ARIES network services."
      ]
    },
    {
      "company": "WebG2",
      "position": "Lead Software Engineer",
      "startDate": "2000",
      "endDate": "2000",
      "summary": "Lead developer with a startup building a novel online marketing intelligence gathering and reporting system.",
      "highlights": [
	    "Developed demonstration technology of online marketing intelligence gathering/reporting system.",
	    "Designed and implemented metadata-driven code generation tools.",
	    "Successfully instituted eXtreme Programming methodologies enabling predictable software delivery at a lower defect rate than previously possible."
      ]
    },
    {
      "company": "Kesmai / Electronic Arts",
      "position": "Software Engineer",
      "startDate": "1997",
      "endDate": "2000",
      "summary": "Technical lead responsible for the continued evolution and development of the ARIES Online Environment and SDKs for EA.",
      "highlights": [
	    "Successfully led initiative to enhance quality of deliverables through automated builds, continuous integration and testing, and consistent documentation of SDKs, standards and practices.",
	    "Architect and project lead of Voltron, a reusable white-box object-oriented C++/Java framework for game services running in the ARIES online environment.",
	    "Successfully delivered tested and documented C++ and Java binary component-based development SDKs, resulting in an explosion of usage of these components, and allowing greater flexibility in managing and upgrading of existing applications.",
	    "Started mentoring program within Tools and Technologies division to disseminate knowledge to junior programmers and enable continuous improvement of software development practices.",
	    "Initial member of Software Process Improvement initiative within Kesmai.  This task force defined the software development and peer review processes for all software developed in-house.",
	    "Post-acquisition of Kesmai by Electronic Arts, lobbied for adoption of proprietary middleware platform (ARIES) for Massively-Multiplayer Online Game development within EA.",
	    "Successfully led project to provide enterprise-wide metrics collection SDKs for MMOG development within EA."
      ]
    },
    {
      "company": "James Madison University",
      "position": "Systems Programmer",
      "startDate": "1995",
      "endDate": "1997",
      "summary": "Systems programmer and systems administrator for university computing systems.",
      "highlights": [
	    "Custom multicore concurrency server programming in HP-UX and VMS environments.",
	    "Systems and network administration of heterogeneous HP-UX, HP MPE/iX, OpenVMS, and NetWare environment."
      ]
    }
  ],
  "education": [
    {
      "institution": "James Madison University",
      "area": "Music Theory and Composition",
      "studyType": "Bachelor of Music (incomplete)"
    }
  ],
  "skills": [
    {
      "name": "Network and Distributed Systems Development",
      "level": "Master",
      "keywords": [
        "C++",
        "Java",
        "Python",
        "BSD Sockets",
        "WinSock",
        "MongoDB"
      ]
    },
    {
      "name": "Database Development",
      "level": "Intermediate",
      "keywords": [
	    "Microsoft SQL Server",
        "Oracle Database",
        "PostgreSQL",
        "MongoDB",
        "SQLAlchemy"
      ]
    },
    {
      "name": "Mobile and Web Development",
      "level": "Intermediate",
      "keywords": [
        "HTML5",
        "CSS3",
        "JavaScript ES5, ES2015, ES2016",
        "NodeJS, NPM, Express",
        "jQuery",
        "Django",
        "Flask",
        "MeteorJS",
        "React",
	    "Phonegap, Cordova",
	    "Android",
	    "iOS"
      ]
    },
    {
      "name": "Game Development",
      "level": "Master",
      "keywords": [
        "C++",
        "C#",
    	"Lua",
        "Unreal Engine",
        "Frostbite Engine",
        "Hero Engine"
      ]
    },    
    {
      "name": "Software Process and Application Lifecycle Management",
      "level": "Master",
      "keywords": [
        "Agile/Iterative/Incremental development processes",
	    "Continuous Integration infrastructure with Jenkins and QuickBuild",
	    "Continuous Deployment infrastructure",
	    "Configuration management",
	    "Software systems modeling with UML and SysML",
	    "Version control with Perforce, Subversion and Git"
      ]
    },
    {
      "name": "Systems Administration",
      "level": "Master",
      "keywords": [
        "Unix systems including HP-UX, Solaris, Linux, and Mac OS X",
        "Windows Server"
      ]
    }
  ]
}
